blog-agentic-coding-and-unproductive-success.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marlin P. Strub</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"><base target="_blank"><meta property="og:image" content="https://www.marlinstrub.com/assets/profile_picture.jpg"><link rel="icon" type="image/svg+xml" href="/assets/favicon.svg"><link rel="icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/assets/apple-touch-icon.png">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Marlin P. Strub
<br />
<span class="subtitle">Roboticist and C++ enthusiast</span>
</h1>
<nav class="site-nav">
  <ul>
    <li><a target="_self" href="index.html">About</a></li>
    <li><a target="_self" href="news.html">News</a></li>
    <li><a target="_self" href="research.html">Research</a></li>
    <li><a target="_self" href="publications.html">Publications</a></li>
  </ul>
</nav>
<script>
  (function () {
    var name = location.pathname.split('/').pop().replace(/\.html$/, '') || 'index';
    document.body.classList.add('page-' + name);
  })();
</script>

<div id="outline-container-org242cc61" class="outline-2">
<h2 id="org242cc61">Agentic coding and unproductive success</h2>
<div class="outline-text-2" id="text-org242cc61">
<p>
Understanding software used to be a byproduct of building it. Getting a feature to work meant grappling with the code: wrong abstractions, incomplete mental models, problems that turned out to be different from what you thought. It was slow and often frustrating. It turns out it was also how deep understanding got built. The efficiency agentic coding offers comes from removing this struggle, and with it, the conditions from which deep understanding can be wrested.
</p>

<p>
Consider two kinds of understanding of a codebase. The reviewer's understanding comes from observation. They read a design document and a pull request, verify that the proposed approach handles edge cases and fits the system's architecture. The author's understanding comes from creation. They try approaches that don't work, discover constraints they didn't anticipate, and reshape their solution as their understanding of the system deepens. Both understand why the chosen solution works, but only the author understands why they discarded the alternatives.
</p>

<p>
You have to be frustrated injecting a dependency through three layers of abstraction to finally realize your abstractions are wrong. You have to spend a puzzled afternoon chasing a segfault before you discover it's due to newly shared state between two subsystems you rarely touch. This is how you earn the understanding that includes the topology of dead ends, the ghosts of all the discarded alternatives. Author-level understanding is the map of the solution space, not just the path that works. No amount of careful reviewing produces it.
</p>

<p>
Learning theory (the human kind) has a name for this. The unsuccessful attempt that precedes a working solution is called a <i>productive failure</i>, and there's robust evidence that it produces deeper understanding than being taught the correct solution directly [1,2,3]. The learning-theory term that applies to agentic coding is <i>unproductive success</i>.
</p>

<p>
An unproductive success is when a task completes but the understanding it produces is shallow. When I delegate work to Claude and it offers a correct solution I'm left with reviewer-level understanding. What's treacherous is that unproductive success is self-concealing. There's no immediate signal that anything was lost.
</p>

<p>
Software engineering is famously about trade-offs. What architecture to use, which part to optimize, how to balance technical debt against execution speed. Now there's a new trade-off and it's not about the product, it's about the process. The depth of understanding you want to develop through working on a feature has become a conscious decision.
</p>

<p>
Business pressure will always favor speed because a lack of understanding bears no cost until something breaks in a novel way and nobody in the room has invested in the mental model needed to diagnose it. Businesses may think they're trading off speed vs. understanding, but they're really trading off speed vs. resilience.
</p>

<p>
Even if coding agents become good enough to complete any well-specified task, someone still has to specify the task. Understanding what to build and diagnosing why what you built doesn't work both require the negative knowledge that only authorship yields. I'm not arguing against agentic coding. I use it every day. But the algorithm that touches core business logic and interacts with subsystems I'll need to reason about to make informed decisions about architecture? That I write myself.
</p>
</div>

<div id="outline-container-org3d34d4b" class="outline-3">
<h3 id="org3d34d4b">References</h3>
<div class="outline-text-3" id="text-org3d34d4b">
<p>
[1] Kapur, M. (2016). Examining Productive Failure, Productive Success, Unproductive Failure, and Unproductive Success in Learning. Educational Psychologist, 51(2), 289-299.
</p>

<p>
[2] Kapur, M. (2014). Productive Failure in Learning Math. Cognitive Science, 38(5), 1008-1022.
</p>

<p>
[3] Bjork, R.A. (1994). Memory and metamemory considerations in the training of human beings. In J. Metcalfe and A. Shimamura (Eds.), Metacognition: Knowing about knowing (pp. 185-205). Cambridge, MA: MIT Press.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<nav class="site-footer">
<a href="mailto:marlin.strub@gmail.com"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M3 7a2 2 0 0 1 2 -2h14a2 2 0 0 1 2 2v10a2 2 0 0 1 -2 2h-14a2 2 0 0 1 -2 -2v-10z"/><path d="M3 7l9 6l9 -6"/></svg>Email</a>
<span class="separator">·</span>
<a href="https://github.com/marlinstrub"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M9 19c-4.3 1.4 -4.3 -2.5 -6 -3m12 5v-3.5c0 -1 .1 -1.4 -.5 -2c2.8 -.3 5.5 -1.4 5.5 -6a4.6 4.6 0 0 0 -1.3 -3.2a4.2 4.2 0 0 0 -.1 -3.2s-1.1 -.3 -3.5 1.3a12.3 12.3 0 0 0 -6.2 0c-2.4 -1.6 -3.5 -1.3 -3.5 -1.3a4.2 4.2 0 0 0 -.1 3.2a4.6 4.6 0 0 0 -1.3 3.2c0 4.6 2.7 5.7 5.5 6c-.6 .6 -.6 1.2 -.5 2v3.5"/></svg>GitHub</a>
<span class="separator">·</span>
<a href="https://linkedin.com/in/marlinstrub"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M4 4m0 2a2 2 0 0 1 2 -2h12a2 2 0 0 1 2 2v12a2 2 0 0 1 -2 2h-12a2 2 0 0 1 -2 -2z"/><path d="M8 11l0 5"/><path d="M8 8l0 .01"/><path d="M12 16l0 -5"/><path d="M16 16v-3a2 2 0 0 0 -4 0"/></svg>LinkedIn</a>
</nav>
</div>
</body>
</html>
